Repository: alessiobrusco13/TripPlanner
Catalog: Trippic/Localization/*.lproj/Localizable.strings
Languages: it

source: Add Photo
it: Aggiungi Foto

source: Adding attachments is disabled at the moment.
it: Aggiungere allegati è disabilitato al momento.

source: Are you sure you want to permanently delete this location?
it: Sei sicuro di voler eliminare permanentemente questa tappa?

source: Attachments
it: Allegati

source: Cancel
it: Annulla

source: Change Location
it: Cambia Tappa

source: Cration Date
it: Data di Creazione

source: Dates
it: Date

source: Delete
it: Elimina

source: Delete selected
it: Cancella selezione

source: Dismiss
it: Annulla

source: Document
it: Documento

source: Done
it: Fatto

source: Edit Trip
it: Modifica Itinerario

source: End date
it: Data di fine

source: End date:
it: Data di fine:

source: Enter trip name
it: Inserire nome dell'itinerario

source: Name:
it: Nome:

source: New Note
it: Nuovo Appunto

source: Notes
it: Appunti

source: Pick Location
it: Scegli Tappa

source: Remove Location
it: Rimuovi Tappa

source: Select your location
it: Scegli la tua tappa

source: Show All Photos
it: Mostra tutte le Foto

source: Start date
it: Data d'inizio

source: Start date:
it: Data di inizio:

source: There aren't any notes for this trip.
it: Non ci sono ancora appunti per questo itinierario

source: There aren't any trips.
it: Non ci sono itinerari

source: Trip Name
it: Nome Itinerario

source: Trips
it: Itinerari

source: New Trip
it: Nuovo Itinerario

source: Delete Trip
it: Elimina Itinerario

source: Type here...
it: Digita qui...

source: Type to edit note...
it: Digita qui per modificare l'appunto...

source: Type to find a location.
it: Digita per trovare una tappa.

source: About
it: Info

source: Swipe to search locations
it: Fai uno swipe per cercare località

source: Delete Selection
it: Elimina Selezione

source: Map
it: Mappa

source: New Location
it: Nuova Tappa

source: Trippic! is a digital diary that lets you document and preserve over time the experiences lived during your trips, through snapshots of landscapes, places and encounters dear to your heart, and the thoughts and sensations you experienced. The app was born from an idea developed by students of the (Liceo Scientifico dell’Istituto del Sacro Cuore di Napoli), following Apple’s guidelines from the ”App design diary” workbook, which led the groups into the phases of brainstorming, planning and evaluation of the prototype. The final phase of the project, consisting the the development of the app and the subsequent stages of testing, improvement of the user experience and publication on the App Store, was handled by the student Alessio Garzia Marotta Brusco with the coordination of (prof.) Domenico Caggiano and the help of the students of the ”App Development with Swift” course. The app, made with the SwiftUI and MapKit frameworks for locating trips, has been made compliant with Apple's Human Interface Guidelines, and fully localized in Italian and English with support for VoiceOver.
it: Trippic! rappresenta un diario digitale per documentare e custodire nel tempo le esperienze vissute durante gli itinerari di viaggio personali, attraverso le istantanee dei paesaggi, dei luoghi e degli incontri rimasti nel cuore, i pensieri e le sensazioni vissute. L’app nasce da un’idea sviluppata dagli studenti della classe terza del Liceo Scientifico dell’Istituto Sacro Cuore di Napoli, seguendo le linee guida del workbook pubblicato da Apple “Diario di progettazione delle app”, che ha guidato i gruppi di lavoro nelle fasi di brainstorming, pianificazione e valutazione del prototipo. La finalizzazione del progetto con lo sviluppo dell’app e le fasi successive di testing, perfezionamento dell’esperienza utente e pubblicazione sull’App Store, è stata curata dallo studente Alessio Garzia Marotta Brusco con il coordinamento del prof. Domenico Caggiano ed il supporto operativo degli studenti del corso “App Development with Swift”. L’app, basata sui framework SwiftUI e MapKit per la localizzazione degli itinerari e delle tappe, è stata resa conforme alle linee guida Apple per lo sviluppo delle interfacce utente, completamente localizzata nelle lingue italiano ed inglese con il supporto al VoiceOver.
